package plagamedicum.ppvis.lab2s4.model;
import net.sf.cglib.core.Local;

import java.time.LocalDate;
import java.util.List;
import java.util.Random;
import java.util.Date;

public class RandomizationData {
    private static String[] surnameList = {
            "Торвольдс", "Плотонов", "Набоков", "Кармак", "Распутин", "Жуков", "Алексеев", "Шевченко", "Клюев", "Романов", "Калиновский", "Железняк", "Карамазов", "Иванов", "Петров", "Шагал", "Малевич", "Пупкин", "Камазов", "Гандзи", "Ленин", "Троцкий", "Гагарин", "Леонтьев", "Лавкрафт", "Кацман", "Манчин", "Колосов", "Крупский", "Лермаонтов", "Блок", "Ломоносов", "Михайлов", "Энштейн", "Эйлер", "Беркочев", "Буль", "Лемононв", "Цой", "Ким", "Маркс", "Денисов", "Марков", "Ван Бюрен", "Мехненко", "Джугаашвили", "Каров", "Макконл", "Гаус", "Рогозин", "Рыбин", "Маврин", "Королев", "Минкевич", "Ямов", "Кадзима", "Вайсинко", "Форд", "Генуев", "Станкевич", "Кутузов", "Камю", "Оруел", "Икаренко", "Черчев", "Сталько", "Камю", "Зиновьев", "Тьюринг", "Фриман", "Калун", "Венс", "Кляйнер", "Азимов", "Стругацкий", "Пшевальский", "Данбровский", "Ли", "Ататин", "Макарэвич", "Кинг", "Штрохайм", "Джостар", "Куджо"
                    };
    private static String[] nameList = {
            "Бронислав", "Линус", "Андрей", "Алексей", "Владимир", "Гедумин", "Джон", "Никита", "Александр", "Геннадийь", "Максим", "Ярослав", "Павел", "Панини", "Юрий", "Иван", "Марк", "Казимир", "Ульфрик", "Герберт", "Стефан", "Якуб", "Янка", "Михаил", "Даниил", "Дмитрий", "Станислав", "Сургей", "Виктор", "Чен", "Сен", "Чен", "Нурсултан", "Мустафа", "Карл", "Гергий", "Цзедун", "Отто", "Адольф", "Ашот", "Армен", "Абрам", "Герман", "Фриц", "Ганс", "Нестор", "Рудольф", "Глеб", "Франц", "Сосо", "Ясунори", "Акира", "Хидэо", "Ван", "Ильяс", "Томми", "Генрих", "Илья", "Семен", "Викентий", "Инокентий", "Карл", "Фердинанд", "Грегор", "Синдзи", "Алонзо", "Сильвестр", "Евгений", "Жан", "Хидеяки", "Алан", "Гордон", "Барни", "Илай", "Айзек", "Джонатан", "Макар", "Курт", "Мартин", "Лютер", "Джотаро", "Абдул"
                    };
    private static String[] patronymList = {
            "Адамович", "Платонович", "Семёнович", "Геннадьевич", "Алексеевич", "Григорьевич", "Иванович", "Александрович", "Николаевич", "Брониславович", "Валентинович", "Витальевич", "Валерьянович", "Игоревич", "Демидович", "Анотольевич", "Демидролович", "Викентьевич", "Абрамович", "Ильясович", "Мустафович", "Стуфанович", "Юрьевич", "Арменьевич", "Павлович", "Богдагович", "Антипович", "Акакьевич", "Иосифович", "Васильевич", "Станиславович", "Игнатьевич", "Махмедович","Евгеньевич", "Ульянович", "Янович", "Викторович", "Мануилович", "Франтишкович"
                    };
    private static String[] addressList = {
            "Корнилова 15", "Клумова 18", "Кропоткина 11", "Советская 105А", "Победы 45", "Васильева 23", "Кременчука 75", "Центральная 72", "Веника 29", "Пельменная 37", "Орженикидзе 86", "Центральная 11", "Купалова 7", "Ленина 17", "Кирова 54", "Кирова 11", "Кропоткина 93", "Центральная 5", "Купалова 27", "ленина 54", "Южная 23", "Троцкого 35", "Иващенко 20", "Кармовая 73", "Ванильная 35", "Центральная 3", "Купалы 76", "Подгорная 37", "Церковная 47", "Цезаря 3", "Нижняя 69", "Пулкина 42", "Каменева 45", "Василевского 18"
    };
    private static String[] conclusionList = {
            "F", "беды с башкой", "шиза", "здоров", "диабет", "рак", "камни в почках", "пропил печень", "отрос аппендикс", "сотрясение", "открытый перелом копчика в 5 местах", "зактырый перелом предплечья", "вывих мизинца на ноге", "гипперактивность", "язва", "мокрота", "выхаркнул легкое от туберкулеза", "проглотил гвоздь", "отек слизистой", "паралич нижних конечностей", "геморрой", "дермаит", "прарноидальное расстройство личности", "кариес в 6", "ОРВ", "бронхит", "12 пулевых, живой", "сотрясение мозга", "перо в печени", "выскрытие показало что пациент умер от вскрытия", "алкоголизм"
    };


    public static String reqSurname(){
        return surnameList[new Random().nextInt(surnameList.length)];
    }

    public static String reqName(){
        return nameList[new Random().nextInt(nameList.length)];
    }

    public static String reqPatronym(){
        return patronymList[new Random().nextInt(patronymList.length)];
    }

    public static String dokSurname(){
        return surnameList[new Random().nextInt(surnameList.length)];
    }

    public static String dokName(){
        return nameList[new Random().nextInt(nameList.length)];
    }

    public static String dokPatronym(){
        return patronymList[new Random().nextInt(patronymList.length)];
    }

    public static String reqAddress(){
        return addressList[new Random().nextInt(addressList.length)];
    }

    public static String reqConclusion(){
        return conclusionList[new Random().nextInt(conclusionList.length)];
    }

    public static  LocalDate reqBirthDate(){
        LocalDate BirthDate = LocalDate.of(new Random().nextInt(80) + 1930, new Random().nextInt(11) + 1, new Random().nextInt(29) + 1);
        return BirthDate;
    }
    public static  LocalDate reqRecDate(){
        LocalDate RecDate = LocalDate.of(new Random().nextInt(60) + 1960, new Random().nextInt( 11) + 1, new Random().nextInt(29) + 1);
        return RecDate;
    }
}
